v2206/urban_testCase/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

// method          scotch;

// scotchCoeffs
// {
//    processorWeights
//    (
//        1
//        1
//        1
//        1
//    );
// }

method          simple;

simpleCoeffs
{
    n               ( 2 2 1 );
    delta           0.001;
}

// hierarchicalCoeffs
// {
//     n               ( 1 1 1 );
//     delta           0.001;
//     order           xyz;
// }

// manualCoeffs
// {
//     dataFile        "";
// }

// distributed     no;

// roots           ( );


// ************************************************************************* //
